app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "chatroom_id", "created_at", "updated_at", "msg_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "hii"], ["user_id", 1], ["chatroom_id", 1], ["created_at", 2017-11-07 23:27:44 +0530], ["updated_at", 2017-11-07 23:27:44 +0530], ["msg_type", "Group"]]
---
  def create
    message = Message.new(message_params)
    message.user = current_user
    if message.save